RANS_1D/channelFlow395K_EPS/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.001; //Co=dt.U/dx

writeControl    timeStep;

writeInterval   5000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//output yplus, ShearStress, min/maxU
functions
{


    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        patches         (lowerWall);
        writeControl    writeTime;
    }
    #includeFunc residuals
    #includeFunc "writeCellCentres"
    #includeFunc "wallShearStress"
}



// ************************************************************************* //
