RANS_1D/channelFlow395K_EPS/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
0.142236
)
;
    }
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
