RANS_1D/channelFlow395K_EPS/system/log
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
Build  : 9-b456138dc4bc
Exec   : pisoFoamspecdpdxi
Date   : Jul 10 2022
Time   : 17:54:33
Host   : "constantinos-Inspiron-5567"
PID    : 17411
I/O    : uncollated
Case   : /home/conmec/CFD/OpenFoam/channelFlow/channelFlow395K_EPS/system
nProcs : 1
sigFpe : Enabling floating point exception trapping (FOAM_SIGFPE).
fileModificationChecking : Monitoring run-time modified files using timeStampMaster (fileModificationSkew 10)
allowSystemOperations : Allowing user-supplied system call operations

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Create time

